Repository: lgernido/ft_transcendence
Catalog: backend/src/locale/*/LC_MESSAGES/djangojs.po
Languages: es, fr

source: Failed to delete the user
es: No se ha podido eliminar el usuario
fr: L'utilisateur n'a pas été supprimé

source: An error occurred while removing the user.
es: Se ha producido un error al eliminar el usuario
fr: Une erreur s'est produite au moment de retirer l'utilisateur

source: Failed to block the user
es: No se ha podido bloquear al usuario
fr: L'utilisateur n'a pas été bloqué

source: An error occurred while blocking the user.
es: Se ha producido un error al bloquear al usuario.
fr: Une erreur s'est produite au moment de bloquer l'utilisateur

source: Failed to unblock the user
es: No se ha podido desbloquear al usuario
fr: L'utilisateur n'a pas été débloqué

source: An error occurred while unblocking the user.
es: Se ha producido un error al desbloquear al usuario.
fr: Une erreur s'est produite au moment de débloquer l'utilisateur

source: Error while looking for the users
es: Error al buscar los usuarios
fr: Une erreur s'est produite au moment de récupérer les utilisateurs

source: No user found
es: No se ha encontrado ningún usuario
fr: Aucun utilisateur trouvé

source: An error occurred while getting the data
es: Se ha producido un error al obtener los datos
fr: Une erreur s'est produite au moment de récupérer les données

source: Can not load friends list
es: No se puede cargar la lista de amigos
fr: Impossible de charger la liste d'amis

source: An error occurred :
es: Se ha producido un error :
fr: Une erreur s'est produite :

source: Failed to fetch profile data
es: Fallo al recuperar los datos del perfil
fr: Erreur pour récupérer les informations du profil

source: Failed to fetch user ID
es: No se ha podido recuperer ID del usuario
fr: Impossible de récupérer l'ID utilisateur

source: Failed to load messages
es: No se ha podido cargar los mensajed
fr: Les messages n'ont pas pu être chargés

source: <p>Impossible to load messages, try again later.</p>
es: Imposible cargar mensajes, inténtelo más tarde.
fr: Impossible de charger les messages, essayer plus tard

source: No message
es: No mensaje
fr: Pas de message

source: Fill out all the categories
es: Rellene todas las categorías
fr: Veuillez remplir tout les champs

source: An error occurred, please try again
es: Se ha producido un error, inténtelo de nuevo
fr: Une erreur s'est produite, veuillez réessayer

source: Choose a valid email address
es: Elija un correo electrónico válida
fr: Veuillez renseigner une adresse email valide

source: Unknown error
es: Error desconocido
fr: Error inconnue

source: Network response was not ok
es: La respuesta de la red no era correcta
fr: Erreur réseau

source: %(winnerName)s Wins!
es: %(winnerName)s gana!
fr: %(winnerName)s gagne !

source: Final Score: %(left)s - %(right)s
es: Resultado final: %(left)s - %(right)s
fr: Score Final: %(left)s - %(right)s

source: Game will redirect to lobby in %(countdown)s seconds...
es: De vuelta al lobby en %(countdown)s segundos
fr: Retour au lobby dans %(countdown)s secondes...

source: Connection closed unexpectedly. Game ended.
es: La conexión se ha cerrado inesperadamente. Juego terminado.
fr: La connexion a été coupée de manière inattendue. Fin de la partie.

source: Error network response
es: La respuesta de la red no era correcta
fr: Erreur réseau

source: Select the number of players
es: Seleccione el número de jugadores
fr: Sélectionner le nombre de joueurs

source: Choose another name
es: Elija otro nombre
fr: Entrer un autre pseudo
